# ProjectionLineWeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..ProjectionLineWeight Property
OverrideGraphicSettings Class See Also
---
The projection surface line weight.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int ProjectionLineWeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectionLineWeight As Integer
	Get
```

Visual C++
---
```text
public:
property int ProjectionLineWeight {
	int get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace